read_verilog box_bus.v 

hierarchy -check -top box_bus

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog box_bus_sintetizado.v