#read design
read_verilog mux2a1_2b_desc_conductual.v
hierarchy -check -top mux2a1_2b_desc_conductual

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#mapping flip-flops to mycells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to mycells.lib
abc -liberty cmos_cells.lib

opt

show

#show -lib cmos_cells.v

#cleanup
clean

# write synthesized design
write_verilog sintetizado2a1_2b.v
