#read design
read_verilog mux_desc_conductual.v
hierarchy -check -top mux_desc_conductual

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#mapping flip-flops to mycells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to mycells.lib
abc -liberty cmos_cells.lib

#show -lib cmos_cells.v

#cleanup
clean

# write synthesized design
write_verilog sintetizado.v